Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །དེ་བས་ཀྱང་ཤིན་ཏུ་གྲངས་མེད་པ་དེ་སྙེད་ཀྱི་རྡུལ་ཕྲ་རབ་ནི་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་ཡོད་དོ།
en: A number of smallest particles even more incalculable than that are those contained in a great trichiliocosm.”

source: །བྱང་ཆུབ་སེམས་དཔས་རྩིས་ཀྱི་ལེའུ་འདི་བསྟན་པའི་ཚེ། རྩིས་པ་ཆེན་པོ་སྲིད་སྒྲུབ་དང་། ཤཱཀྱའི་ཚོགས་ཐམས་ཅད་ཀྱང་ཚིམ་ཞིང་མགུ་ལ་ཡི་རངས་ཏེ་ངོ་མཚར་རྨད་དུ་བྱུང་བ་ཐོབ་ནས།
en: When the Bodhisattva demonstrated this display of calculation, the great mathematician Arjuna and the entire assembly of Śākyas were surprised and delighted, and they felt great appreciation and joy.

source: དེ་དག་ཐམས་ཅད་ཀྱང་གོས་རེ་རེ་ཞིག་བཞག་སྟེ་གོས་དང་རྒྱན་ལྷག་མ་གཞན་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཡོན་དུ་ཕུལ་ལོ།
en: They each kept just a single garment for themselves and offered the remaining garments and jewelry to the Bodhisattva.

source: །དེ་ནས་རྩིས་པ་ཆེན་པོ་སྲིད་སྒྲུབ་ཀྱིས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: Then the great mathematician Arjuna uttered the following verses:

source: །འདི་ལྟར་བྱེ་བ་བརྒྱ་ན་ཐེར་འབུམ་དེ་བཞིན་དུ།
en: “One hundred times ten million is a billion.

source: །ཁྲག་ཁྲིག་དང་ནི་གཏམས་པའི་རྒྱུད་དང་དེ་བཞིན་དུ།
en: Likewise it is for one hundred billion and one quadrillion,

source: །དཀྲིགས་པ་མི་འཁྲུགས་བདག་གི་ཤེས་ཐུག་དེ་གོང་མིན།
en: And also for a sextillion and a nonillion, but beyond that is unknown to me.

source: །མཚུངས་པ་མེད་ཀྱི་མཁྱེན་པ་རྩིས་ལ་དེ་བས་ལྷག །ཡང་ཀྱེ་ཤཱཀྱ་དག །སྟོང་གསུམ་དག་གི་རྡུལ་དང་རྩྭ་དང་ནགས་ཚལ་དང་། །སྨན་དང་ཆུ་ཡི་ཐིགས་པ་ཇི་སྙེད་ཡོད་པ་ཡང་། །ཧུང་ཞེས་བྱ་བ་གཅིག་ལ་འདི་ཡིས་རྩི་ནུས་ན།
en: So in mathematics, the knowledge of the Peerless One is superior. “Moreover, Śākyas, If he can calculate in the duration of a single utterance of the sound huṃ, All the dust particles, blades of grass, forests, Medicinal herbs, and drops of water in a trichiliocosm,

source: །ལྔ་བརྒྱ་ཙམ་དག་གི་ལྟ་ངོ་མཚར་ཅི་ཞིག་ཆེ།
en: Then what is so amazing about the other five hundred boys?”

source: །དེ་ནས་ལྷ་དང་མི་བརྒྱ་སྟོང་དག །ཨེ་མ་ཨ་ལ་ལ་ཞེས་ཟེར་ཞིང་ཅ་ཅོ་དང་། ག་ཞའི་སྒྲ་བརྒྱ་སྟོང་འབྱིན་པར་གྱུར་ཏོ།
en: When he said this, hundreds of thousands of gods and humans let out hundreds of thousands of exclamations of shock and cries of joy.

source: །ནམ་མཁའི་དཀྱིལ་ནས་ལྷའི་བུ་དག་གིས་ཀྱང་ཚིགས་སུ་བཅད་པ་འདི་དག་བརྗོད་དོ།
en: From the center of the sky, gods called out the following verse:

source: །དུས་གསུམ་སེམས་ཅན་མ་ལུས་ཇི་སྙེད་གང་ཡོད་པའི། །སེམས་དང་སེམས་བྱུང་འདུ་ཤེས་རྣམ་པར་རྟོག་པ་དག །མཆོག་དང་ཐ་མ་དེ་བཞིན་རྒྱ་ཆུང་ཡངས་པ་དག །ཐམས་ཅད་སེམས་ཀྱི་འགྱུར་བ་གཅིག་གིས་རབ་ཏུ་མཁྱེན།
en: “The Bodhisattva perfectly understands, with a single movement of his mind, All the primary and subsidiary mental states, conceptions, and opinions That belong to all beings throughout the three times without exception, Whether they be inferior or superior, narrow or broad.”

source: །དགེ་སློང་དག་དེ་ལྟར་ཤཱཀྱ་གཞོན་ནུ་དེ་དག་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པར་གྱུར་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་ཁྱད་པར་དུ་འཕགས་པར་གྱུར་ཏོ།
en: Monks, in this way all the Śākya youths were defeated and the Bodhisattva alone stood out.

source: །དེའི་རྗེས་ལ་མཆོངས་པ་དང་། རྐྱལ་དང་། བང་ལ་སོགས་པ་ཐམས་ཅད་ལའང་བྱང་ཆུབ་སེམས་དཔའ་ཉིད་ཁྱད་པར་དུ་འཕགས་པར་གྱུར་ནས།
en: As the day progressed, the Bodhisattva also excelled in all aspects of leaping, swimming, and running.

source: ནམ་མཁའི་དཀྱིལ་ནས་ལྷའི་བུ་དག་གིས་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: In the sky above, gods sang these verses:

source: །བརྟུལ་ཞུགས་དཀའ་ཐུབ་སྡོམ་པའི་ཡོན་ཏན་དང་། །བསྐལ་པ་བྱེ་བར་བཟོད་དུལ་བྱམས་སྟོབས་ཀྱིས།
en: “With the qualities of disciplined conduct and austerity And the strength of his forbearance, discipline, and love, developed over millions of eons,

source: །ལུས་དང་སེམས་ནི་ཅི་ནས་ཡང་མཛད་པས།
en: He is a leader with a body and mind that are supple in action,

source: །དེ་ཡི་ཤུགས་ཀྱི་ཁྱད་པར་མཉན་པར་གྱིས།
en: And so you now witness the superiority of his swiftness.

source: །སེམས་ཅན་མཆོག་འདི་གྲོང་ཁྱེར་འདི་ན་བཞུགས་པར་ཁྱེད་ཀྱིས་མཐོང་།
en: “You see this most excellent being here in this city,

source: །འོན་ཀྱང་འདི་ནི་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ཁམས་རྣམས་ཐམས་ཅད་དུ།
en: But instantaneously he is moving throughout the ten directions, Paying homage to infinite victorious ones,

source: །སྐད་ཅིག་གཅིག་ལ་རིན་ཆེན་གསེར་དང་མཆོད་པ་སྣ་ཚོགས་ཀྱིས། །
en: With a plethora of jewels and gold, in infinite worlds.

source: རྒྱལ་བ་དཔག་ཏུ་མེད་པ་དག་ལ་མཆོད་པ་མཛད་དུ་བཞུད། །འོན་ཀྱང་རྫུ་འཕྲུལ་དེ་འདྲ་བརྙེས་པ་དེ།
en: “Yet you are totally unaware of his comings and goings; Such is the extent of his miraculous powers.

source: །བྱོན་ཏམ་བཞུད་པར་ཁྱེད་ཀྱིས་ཡོང་མི་ཤེས།
en: So why should his skills here provoke wonder?

source: །ཇི་ཙམ་ཞུགས་ཞེས་དེ་ལ་ཅི་ཞིག་བསྐྱེད།
en: He is without equal, and you should feel respect for him.”

source: །འདི་ནི་མཚུངས་པ་མེད་ཀྱིས་རིམ་གྲོ་སྐྱེད། །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཅིག་པུ་ཁྱད་པར་དུ་འཕགས་པར་གྱུར་ཏོ།
en: With his performances, the Bodhisattva uniquely distinguished himself.

source: །དེ་ནས་ཤཱཀྱ་དེ་དག་གིས་སྨྲས་པ། གཞོན་ནུ་འདི་ལ་སྟོབས་ཀྱི་ཁྱད་པར་ཅི་ཡོད་པའང་སད་པར་བྱའོ།
en: The Śākyas then said, “The prince should also be tested in terms of his strength.”

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཕྱོགས་གཅིག་ཏུ་འདུག་ནས། ཤཱཀྱ་གཞོན་ནུ་ལྔ་བརྒྱ་པོ་དེ་དག་ཀྱང་དུས་གཅིག་ཏུ་སོ་སོ་ནས་སྟོབས་འགྱེད་པར་གྱུར་ཏེ།
en: At that time the Bodhisattva stood to one side while the five hundred Śākya youths wrestled among themselves.

source: ཤཱཀྱ་གཞོན་ནུ་སུམ་ཅུ་རྩ་གཉིས་ཤིག་འཚོགས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་བརྒལ་བ་ལྟར་ཆས་ཏེ་འཁོད་དོ།
en: Then thirty-two Śākya youths stayed on to confront the Bodhisattva in wrestling.

source: །དེའི་ནང་ནས་དགའ་བོ་དང་། ཀུན་དགའ་བོ་གཉིས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྟོབས་བརྒལ་བའི་ཕྱིར་དྲུང་དུ་ཕྱིན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལག་གིས་རེག་མ་ཐག་ཏུ་དེ་གཉིས་ཀས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་མཐུ་དང་གཟི་བརྗིད་མ་བཟོད་དེ་ས་ལ་སྒྱེལ་ཏོ།
en: First Nanda and Ānanda approached the Bodhisattva to wrestle with him. But as soon as the Bodhisattva merely touched the two boys, they were unable to withstand the Bodhisattva’s power and brilliance, and they collapsed on the ground. Next Devadatta vied with the Bodhisattva.

source: །དེའི་འོག་ཏུ་ཤཱཀྱ་གཞོན་ནུ་ལྷ་སྦྱིན་ང་རྒྱལ་ཅན་མཐུ་སྙེམས་པ་དེ་སྟོབས་ཀྱི་ང་རྒྱལ་དང་ཤཱཀྱའི་ང་རྒྱལ་གྱིས་སྙེམས་ལ།
en: He was a conceited and arrogant young man, who was bloated with pride about his strength and his relationship to the Śākya lineage.

source: བྱང་ཆུབ་སེམས་དཔའ་ལ་སྔོ་ཞིང་ཐམས་ཅད་དང་ལྡན་པའི་ལྟད་མོ་པའི་དཀྱིལ་འཁོར་ལ་བསྐོར་ཏེ།
en: In the arena filled with spectators, Devadatta first made a round clockwise, and then he lunged at the Bodhisattva.

source: བསྒྱིངས་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་སྟོབས་བརྒལ་ཏོ།
en: The Bodhisattva, however, was calm and unhurried.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་མ་བརྟབས་ཤིང་མི་རིངས་པར་སྟངས་བཟང་པོར་གཞོན་ནུ་ལྷ་སྦྱིན་ལག་པ་གཡས་པས་བཏེག་སྟེ་བསད་པའི་བློས་མ་ཡིན་གྱི་ང་རྒྱལ་བཅག་པའི་ཕྱིར་བྱམས་པའི་སེམས་ཀྱིས་ནམ་མཁའ་ལས་བསྐོར་བསྐོར་ཏེ་སའི་སྟེང་དུ་བོར་ཡང་དེའི་ལུས་ལ་གནོད་པར་གྱུར་པ་མེད་དོ།
en: He playfully seized Devadatta with his right hand, twirled him into a triple spin, and tossed him to the ground. All the while the Bodhisattva’s mind was full of love. He did not intend to hurt Devadatta, but only to break his pride. Therefore Devadatta was unharmed.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། དེ་ལྟ་བུ་གནོད་པར་འགྱུར་བས་ཆོག་གིས་ཐམས་ཅད་གཅིག་ཏུ་འདུས་ཏེ་བརྒལ་བར་གྱིས་ཤིག །
en: Then the Bodhisattva said, “Enough of this quarrel.

source: དེ་ནས་དེ་དག་ཐམས་ཅད་ང་རྒྱལ་གྱིས་རློམ་ཞིང་བྱང་ཆུབ་སེམས་དཔའ་ལ་རུབ་པར་གྱུར་ཏོ།
en: You should now all join up and confront me in wrestling.” Exhilarated, they all assailed the Bodhisattva.

source: །དེ་ནས་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་རེག་མ་ཐག་ཏུ་བྱང་ཆུབ་སེམས་དཔའི་དཔལ་དང་གཟི་བརྗིད་དང་ལུས་ཀྱི་མཐུ་མ་བཟོད་དེ།
en: However, as soon as the Bodhisattva touched them, they were unable to withstand his splendor, brilliance, physical strength, and stamina.

source: བྱང་ཆུབ་སེམས་དཔས་རེག་པ་ཙམ་གྱིས་ས་ལ་འགྱེལ་བར་གྱུར་ཏོ།
en: Merely by his touch, they fell to the ground.

source: །དེ་ནས་ལྷ་དང་མི་བརྒྱ་སྟོང་དེ་དག་ཨེ་མ་ཨ་ལ་ལ་ཞེས་ཟེར་ཞིང་། ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་བརྒྱ་སྟོང་ཕྱུང་ངོ་།
en: Then hundreds of thousands of gods and humans let out hundreds of thousands of exclamations of shock and cries of joy.

source: །ནམ་མཁའི་དཀྱིལ་ན་འཁོད་པའི་ལྷའི་བུ་དག་གིས་ཀྱང་མེ་ཏོག་གི་ཆར་ཆེན་པོ་མངོན་པར་ཕབ་སྟེ། དབྱངས་གཅིག་ཏུ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: The gods in the sky showered down a rain of flowers and called out these verses:

source: །ཕྱོགས་བཅུའི་སེམས་ཅན་གང་རྣམས་ཇི་སྙེད་པ།
en: “Even if all the myriad beings in the ten directions

source: །དེ་དག་གྱད་ཆེན་སྟོབས་པོ་ཆེ་འདྲ་ལ།
en: Became like mighty wrestlers inclined to foul play

source: །ཅིག་ཅར་སྐྱེས་བུའི་མཆོག་ལ་རུབ་གྱུར་ཀྱང་། །རེག་པ་ཙམ་གྱིས་ས་ལ་འགྱེལ་བར་འགྱུར།
en: And converged on this bull among men, His mere touch would bring them to the ground.

source: །ལྷུན་པོ་རི་རབ་རྡོ་རྗེའི་འཁོར་ཡུག་དང་། །ཕྱོགས་བཅུ་དག་ན་རི་གཞན་གང་ཡོད་པ། །ལག་པས་མཉེས་ཤིང་རྨེག་མེད་ཕྱེར་རློག་ན། །མི་ལུས་སྙིང་པོ་མེད་པ་མཚར་ཅི་ཆེ།
en: “Grabbing Meru, the foremost mountain and the adamantine mountain ranges, And all other mountains throughout the ten directions, He could reduce them all to powder, So what is so amazing about a human body with no substance?

source: །འདི་ནི་ཤིང་དབང་མཆོག་དྲུང་སྡང་བའི་གྱད། །དཔུང་བཅས་བདུད་རྣམས་རྒྱལ་མཚན་སྡེར་བཅས་པ། །ནག་པོའི་རྩ་ལག་བྱམས་པའི་སྟོབས་ཀྱིས་འཇོམས། །བླ་མེད་བྱང་ཆུབ་ཞི་བར་འཚང་ཡང་རྒྱ།
en: “Through the strength of his love, he will vanquish Māra—That mighty, foul-playing wrestler—along with his bannered forces of footmen and cavalry. Under the most excellent lord of trees, he will vanquish this friend of darkness And peacefully attain unexcelled awakening.”

source: །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཅིག་པུ་ཁྱད་པར་དུ་འཕགས་པར་གྱུར་ཏོ།
en: In this way the Bodhisattva, fighting alone, was the winner.

source: །དེ་ནས་ཤཱཀྱ་ལག་ན་བེ་ཅོན་ཅན་གྱིས་ཤཱཀྱ་གཞོན་ནུ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །འདི་དག་ནི་སད་ཀྱང་ཟིན།
en: Then Daṇḍapāṇi said to the Śākya youths, “This has now been tested and witnessed.

source: མཐོང་ཡང་ཟིན་གྱིས་ད་ནི་འཕོང་ཞིག་བསྟན་པར་གྱིས་ཤིག །དེའི་ཚེ་ཀུན་དགའ་བོས་རྒྱང་གྲགས་གཉིས་ཀྱི་ཕ་རོལ་ཏུ་ལྕགས་ཀྱི་རྔ་གཅིག་འབེན་དུ་བཙུགས་སོ།
en: Next let him demonstrate his skill in archery.” First Ānanda placed an iron drum twice shouting-distance away as his target.

source: །དེའི་འོག་ཏུ་ལྷ་སྦྱིན་གྱིས་རྒྱང་གྲགས་བཞིའི་ཕ་རོལ་ཏུ་ལྕགས་ཀྱི་རྔ་གཅིག་འབེན་དུ་བཙུགས་སོ།
en: Next Devadatta placed an iron drum four times shouting-distance away as his target.

source: །དེའི་འོག་ཏུ་མཛེས་དགའ་བོས་རྒྱང་གྲགས་དྲུག་གི་ཕ་རོལ་ཏུ་ལྕགས་ཀྱི་རྔ་གཅིག་འབེན་དུ་བཙུགས་སོ།
en: Then Sundarananda placed an iron drum six times shouting-distance away as his target.

source: །དེའི་འོག་ཏུ་ཤཱཀྱ་ལག་ན་བེ་ཅོན་ཅན་གྱིས་རྒྱང་གྲགས་བརྒྱད་ཀྱི་ཕ་རོལ་ཏུ་ལྕགས་ཀྱི་རྔ་གཅིག་འབེན་དུ་བཙུགས་སོ།
en: Daṇḍapāṇi placed an iron drum eight times shouting-distance away as his target.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་རྒྱང་གྲགས་བཅུའི་ཕ་རོལ་ཏུ་ལྕགས་ཀྱི་རྔ་གཅིག་འབེན་དུ་བཙུགས་ཏེ།
en: Finally the Bodhisattva placed an iron drum ten times shouting-distance away as his target.

source: དེའི་དྲུང་དུ་ཤིང་ཏ་ལ་བདུན་དངར་ནས་དེའི་ཕ་རོལ་ཏུ་ལྕགས་ཀྱི་ཕག་རྒོད་ཀྱི་གཟུགས་འཁྲུལ་འཁོར་དུ་བྱས་པ་གཅིག་བཙུགས་སོ།
en: Behind the drum he set up seven palm trees, and beyond that he set up an iron image of a wild boar.

source: །དེ་ནས་ཀུན་དགའ་བོས་རྒྱང་གྲགས་གཉིས་ཀྱི་ཕ་རོལ་ན་རྔའི་འབེན་འདུག་པ་ལ་འཕངས་ན་ཕོག་པར་གྱུར་ཏེ། དེ་ཕན་ཆོད་ཀྱི་ལ་ཕོག་པར་མ་ནུས་སོ།
en: Ānanda struck his drum target twice shouting-distance away, but he could not shoot any farther.

source: །ལྷ་སྦྱིན་གྱིས་རྒྱང་གྲགས་བཞིའི་ཕ་རོལ་ན་རྔའི་འབེན་འདུག་པ་ལ་འཕངས་ན་ཕོག་པར་གྱུར་ཏེ། དེ་ཕན་ཆད་ཀྱིལ་ཕོག་པར་མ་ནུས་སོ།
en: Devadatta struck the drum target four times shouting-distance away, but he also could not shoot any farther.

source: །མཛེས་དགའ་བོས་རྒྱང་གྲགས་དྲུག་གི་ཕ་རོལ་ན་རྔའི་འབེན་འདུག་པ་ལ་འཕངས་ན་ཕོག་པར་གྱུར་ཏེ། དེ་ཕན་ཆད་ཀྱི་ལ་ཕོག་པར་མ་ནུས་སོ།
en: Then Sundarananda struck the drum target six times shouting-distance away, but he was also unable to shoot any farther.

source: །ལག་ན་བེ་ཅོན་ཅན་གྱིས་རྒྱང་གྲགས་བརྒྱད་ཀྱི་ཕ་རོལ་ན་རྔའི་འབེན་འདུག་པ་ལ་འཕངས་ན་ཕོག་པར་གྱུར་ཏེ། ཐལ་བྱུང་དུ་ཕྱིན་ནས་དེ་ཕན་ཆད་ཀྱི་ལ་ཕོག་པར་མ་ནུས་སོ།
en: Daṇḍapāṇi struck the drum target eight times shouting-distance away and pierced it, but he also could not shoot any farther than that.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ལ་གཞུ་གང་དང་གང་བྱིན་པ་དེ་དག་ལ་ལ་ནི་གཞུ་རྒྱུད་ཆད།
en: However, whichever bow the Bodhisattva drew, the string snapped or the bow broke.

source: ལ་ལ་ནི་ཆག་ནས་བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། གྲོང་ཁྱེར་འདི་ན་གཞུ་གཞན་ལ་ལ་བདག་གིས་བདུང་བཟོད་པའམ། ལུས་ཀྱི་སྟོབས་དང་མཐུ་བཟོད་པ་མཆིས་སམ།
en: So the Bodhisattva asked, “King, is there any other bow here in the city that I can string or that can withstand my physical strength?”

source: རྒྱལ་པོས་སྨྲས་པ། བུ་ཡོད་དོ། །
en: “Yes, my son, there is.” replied the king.

source: གཞོན་ནུས་སྨྲས་པ། ལྷ་དེ་ལྟ་བུ་གང་ན་མཆིས།
en: “Where is it?” asked the boy.

source: རྒྱལ་པོས་སྨྲས་པ། བུ་ཁྱོད་ཀྱི་མེས་སེང་གེའི་ཟ་འགྲམ་ཞེས་བྱ་བ་བྱུང་སྟེ།
en: “Son,” the king answered, “your grandfather was called Siṃhahanu.

source: དེའི་གནམ་རུ་ད་ལྟར་ལྷ་ཁང་ན་སྤོས་དང་ཕྲེང་བས་མཆོད་དེ།
en: He had a bow that is now being honored in the temple with incense and flower garlands.

source: དེ་ནི་སུས་ཀྱང་བདུང་བར་ཡང་མི་ནུས་ན། དགང་བར་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་པ་ཞིག་ཡོད་དོ།
en: No one since him has been able to string the bow, let alone draw it.”

source: །བྱང་ཆུབ་སེམས་དཔས་སྨྲས་པ། ལྷ་དེ་བླང་དུ་གསོལ། སད་པར་བགྱིའོ།
en: The Bodhisattva said, “Your Majesty, may the bow be brought here! I would like to test it.”

source: །དེ་ནས་གཞུ་དེ་བླངས་ཏེ་འོངས་པ་དང་། ཤཱཀྱ་གཞོན་ནུ་ཐམས་ཅད་ཀྱིས་ནན་ཏན་གྱི་མཆོག་གིས་བསྒྲིམས་ཀྱང་གཞུ་དེ་བདུང་བར་ཡང་མ་ནུས་ན་དགང་བར་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ་མ་ནུས་སོ།
en: When the bow was brought to the assembly, all the Śākya youths tried pulling the bow with all their strength, but they were unable to string it, let alone draw it.

source: །དེ་ནས་གཞུ་དེ་ཤཱཀྱ་ལག་ན་བེ་ཅོན་ཅན་གྱིས་ལུས་ཀྱི་མཐུ་སྟོབས་ཐམས་ཅད་ཕྱུང་སྟེ། གཞུ་དེ་བདུང་བར་བརྒལ་ན་མ་བདུངས་སོ།
en: Then the bow was placed before the Śākya Daṇḍapāṇi, who mustered all his bodily strength and endurance and tried to string the bow, but could not.

source: །དེ་ནས་གཞུ་དེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་བྱིན་ནོ།
en: Finally the bow was placed before the Bodhisattva.

source: །དེ་ནས་བྱང་ཆུབ་སེམས་དཔས་གཞུ་དེ་བླངས་ཏེ་སྟན་ལས་མ་ལངས་པར་སྐྱིལ་མོ་ཀྲུང་ཕྱེད་བཅས་ཏེ། ལག་པ་གཡོན་པས་བཟུང་ནས་ལག་པ་གཡས་པའི་སོར་མོ་གཅིག་གིས་བདུངས་སོ།
en: He picked it up and, sitting on his seat in the cross-legged position, he held it with his left hand and strung it with a single fingertip of his right hand.

source: །གཞུ་དེ་དེ་ལྟར་བདུངས་པའི་ཚེ་སེར་སྐྱའི་གནས་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ཐམས་ཅད་དུ་སྒྲ་མངོན་པར་གྲག་པར་གྱུར་ཏོ།
en: While he was stringing the bow, a sound resonated throughout the entire city of Kapilavastu.

source: །གྲོང་ཁྱེར་གྱི་མི་ཐམས་ཅད་ཀྱང་སྐྲག་སྐྲག་པོར་གྱུར་ཏེ། གཅིག་ལ་གཅིག་འདྲི་ཞིང་འདི་ལྟར་ཅིའི་སྒྲ་ཞིག་ཅེས་ཟེར་རོ།
en: All the townspeople became agitated and asked one another where the sound came from.

source: །དེ་ལ་ལ་ལ་ན་རེ་གཞོན་ནུ་དོན་གྲུབ་ཀྱིས་མེས་ཀྱི་གནམ་རུ་བདུངས་ནས་དེའི་སྒྲ་བྱུང་བ་ནི་འདི་ཡིན་ནོ་ཞེས་ཟེར་རོ། །དེ་ནས་ལྷ་དང་མི་བརྒྱ་སྟོང་དག་ཨེ་མ་ཨ་ལ་ལ་ཞེས་ཟེར་ཞིང་ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་བརྒྱ་སྟོང་འབྱིན་པར་གྱུར་ཏོ། །ནམ་མཁའི་དཀྱིལ་ན་འཁོད་པའི་ལྷའི་བུ་དག་གིས་ཀྱང་།
en: Some said, “The sound is surely from Prince Sarvārthasiddha, who has strung his grandfather’s bow.” Then hundreds of thousands of gods and humans let out hundreds of thousands of exclamations of shock and cries of joy.

source: རྒྱལ་པོ་ཟས་གཙང་མ་དང་། སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེ་དེ་དག་ལ་ཚིགས་སུ་བཅད་དེ་སྨྲས་པ།
en: The gods in the sky then addressed this verse to King Śuddhodana and to the masses:

source: གདན་ལས་མ་བཞེངས་བརྩལ་བ་མ་མཆིས་སུ། །ཐུབ་པས་གནམ་རུ་འདི་འདྲ་བདུངས་པ་ལས། །གདོན་མི་འཚལ་བར་དགོངས་པ་རྫོགས་གྱུར་ཏེ། །བདུད་ཀྱི་སྡེ་བཅོམ་མྱུར་དུ་ཐུབ་པར་བྱོན།
en: “Just as this bow was drawn by the Sage Without rising from his seat, So will he undoubtedly fulfill his purpose And conquer the armies of Māra with ease.”

source: །དགེ་སློང་དག་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔས་མདའ་བླངས་ནས་གཞུ་དེ་དང་སྦྱར་ཏེ་བཀང་ནས་འཕངས་པའི་མཐུ་སྟོབས་ཀྱིས་ཀུན་དགའ་བོའི་འབེན་དུ་རྔ་བཙུགས་པ་དང་། ལྷ་སྦྱིན་གྱི་འབེན་དུ་རྔ་བཙུགས་པ་དང་། མཛེས་དགའ་བོའི་འབེན་དུ་རྔ་བཙུགས་པ་དང་། ལག་ན་བེ་ཅོན་ཅན་གྱི་འབེན་དུ་རྔ་བཙུགས་པ་དེ་དག་ཐམས་ཅད་ལས་ཐལ་ནས་རྒྱང་གྲགས་བཅུའི་ཕ་རོལ་ཏུ་བདག་གི་འབེན་ལྕགས་ཀྱི་རྔ་བཙུགས་པ་དང་། ཤིང་ཏ་ལ་བདུན་དངར་བ་དང་། ཕག་རྒོད་ཀྱི་གཟུགས་འཁྲུལ་འཁོར་དུ་བྱས་པ་ལས་ཀྱང་ཐལ་ཏེ་མདའ་དེ་ས་ལ་ཟུག་ནས་མི་སྣང་བར་ནུབ་པར་གྱུར་ཏོ།
en: Monks, the Bodhisattva now picked up an arrow, drew the bow, and released the arrow. His shot was so powerful that the arrow went right through the targets set up by Ānanda, Devadatta, Sundarananda, and Daṇḍapāṇi. The arrow then cleaved his own iron drum target, which was ten times shouting-distance away, then pierced the seven palm trees and the iron image of a boar before it finally entered the ground and disappeared.

source: །ས་ཕྱོགས་གང་དུ་མདའ་དེ་ཟུག་སྟེ་ནུབ་པའི་ས་ཕྱོགས་དེར་ཁྲོན་པ་ལྟ་བུའི་ཁུང་ཞིག་བྱུང་ནས་ད་ལྟར་ཡང་མདའི་ཁྲོན་པ་ཞེས་བྱ་བ་ཡིན་ནོ།
en: There, in the area where the arrow pierced the ground and vanished, a crater formed, which still to this day is called Arrow Crater.

source: །དེའི་ཚེ་ལྷ་དང་མི་བརྒྱ་སྟོང་དག །ཨེ་མ་ཨ་ལ་ལ་ཞེས་ཟེར་ཞིང་ཅ་ཅོ་དང་ག་ཞའི་སྒྲ་བརྒྱ་སྟོང་འབྱིན་པར་གྱུར་ཏོ།
en: Then hundreds of thousands of gods and humans let out hundreds of thousands of exclamations of surprise and cries of joy.

source: །ཤཱཀྱའི་ཚོགས་དེ་དག་ཐམས་ཅད་ཀྱང་ངོ་མཚར་རྨད་དུ་བྱུང་བ་ཐོབ་སྟེ།
en: The entire assembly of Śākyas was shocked and astonished.

source: ཀྱེ་ངོ་མཚར་ཏོ།
en: They said, “How amazing!

source: །འདིས་ནི་བསླབས་ཀྱང་མ་བསླབས་པར་རྩལ་གྱི་ཤེས་པ་དེ་ལྟ་བུ་དང་ལྡན་པ་ནི་ངོ་མཚར་ཆེའོ་ཞེས་ཟེར་རོ།
en: He has such expertise in the arts, without even having trained.”

source: །ནམ་མཁའི་དཀྱིལ་ན་འཁོད་པའི་ལྷའི་བུ་དག་གིས་ཀྱང་རྒྱལ་པོ་ཟས་གཙང་མ་དང་། སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེ་དེ་དག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: The gods in the sky then called out to King Śuddhodana and the masses, “O people, why be so amazed?

source: །དེ་ལྟར་ངོ་མཚར་ཡང་ཅི་ཆེ་སྟེ། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Do you know what’s amazing?

source: འདི་ནི་ས་ཡི་སྙིང་པོ་སྔོན་གྱི་སངས་རྒྱས་གདན་ལ་བཞུགས།
en: “He will sit on this earth, on the seat of the previous awakened ones.

source: །ཞི་གནས་གནམ་རུ་ཐོགས་ཤིང་སྟོང་པ་བདག་མེད་མདའ་རྣམས་ཀྱིས།
en: Holding the bow of calm abiding, he will shoot the arrows of empty lack of self,

source: །ཉོན་མོངས་དགྲ་རྣམས་བཅོམ་སྟེ་ལྟ་བའི་དྲ་བ་དྲལ་ནས་སུ།
en: And so destroy the enemies, the afflictions; rend asunder the net of views;

source: །བྱང་ཆུབ་དམ་པ་ཞི་བ་རྡུལ་མེད་མྱ་ངན་མེད་པ་འཐོབ།
en: And attain sublime awakening—tranquil, stainless, and free from sorrow.”

source: །དེ་སྐད་ཅེས་སྨྲས་ནས། ལྷའི་བུ་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལྷའི་མེ་ཏོག་དག་གིས་མངོན་པར་གཏོར་ཏེ་དོང་ངོ་། །དེ་བཞིན་དུ་མཆོངས་པ་དང་། ཡི་གེ་དང་། ལག་རྩིས་དང་། རྩིས་དང་། གྲངས་དང་། གྱད་ཀྱི་འཛིན་སྟངས་དང་། རྒྱང་ནས་ཕོག་པ་དང་། བང་དང་། ཚར་དང་། རྐྱལ་དང་། འཕོང་དཔྱད་དང་། གླང་པོ་ཆེའི་གཉར་ཞོན་པ་དང་། རྟ་རྩལ་དང་། ཤིང་རྟའི་ཐབས་དང་། མདའ་གཞུའི་ཐབས་དང་། བརྟན་པ་དང་། མཐུ་དང་། དཔའ་བ་དང་། འགྱེད་སྟོབས་དང་། ལྕགས་ཀྱུས་སྒྱུར་ཐབས་དང་། ཞགས་པའི་ཐབས་དང་། མདུན་དུ་བསྣུར་བ་དང་། ཕྱིར་བསྣུར་བ་དང་། བཟུར་བ་དང་། འཛིན་སྟངས་དང་། གོམ་སྟབས་དང་། ཐོར་ཚུགས་དང་། གཅད་པ་དང་། དྲལ་བ་དང་། དབུག་པ་དང་། གཞིག་པ་དང་། གཤེག་པ་དང་། མི་འཆོར་བར་འཕོག་པ་དང་། གནད་དུ་འཕོག་པ་དང་། སྒྲ་གྲག་པར་འཕོག་པ་དང་། ཚབས་ཆེ་བ་དང་། ཆོ་ལོའི་རྩེད་མོ་དང་། སྙན་དངགས་སྦྱར་བ་དང་། ལམ་དང་། རི་མོ་དང་། གཟུགས་དང་། གཟུགས་ཀྱི་ལས་དང་། ཐབས་ཀྱི་དཔྱད་དང་། མེའི་ལས་དང་། རོལ་མོའི་དབྱངས་སྒྲ་དང་། གར་དང་། གླུ་དང་། ཡི་གེ་ཀླག་པའི་མིག་འོར་དང་། གཏམ་དང་། བཞད་གད་དང་། རྩེད་མོ་དང་། བྲོ་དང་། སྒེག་པ་དང་། ཕྲེང་བ་བརྒྱུ་བ་དང་། རླུང་ཡབ་གཡོབ་པ་དང་། ནོར་བུ་ཚོན་གྱིས་བསྒྱུར་བ་དང་། གོས་ཚོན་གྱིས་བསྒྱུར་བ་དང་། མིག་འཕྲུལ་གྱི་ཆོ་ག་དང་། རྨི་ལམ་གྱི་དཔྱད་དང་། བྱའི་སྐད་དང་། བུད་མེད་ཀྱི་མཚན་དང་། སྐྱེས་པའི་མཚན་དང་། གླང་པོ་ཆེའི་མཚན་དང་། རྟའི་མཚན་དང་། བ་ལང་གི་མཚན་དང་། རའི་མཚན་དང་། ལུག་གི་མཚན་དང་། ཁྱིའི་མཚན་དང་། ཤེས་གསལ་དང་། སྒྲ་ངེས་པར་སྦྱོར་བ་དང་། ང་རོ་སྒྱུར་བ་དང་། སྔོན་གྱི་རབས་དང་། སྔོན་བྱུང་བ་དང་། རིག་བྱེད་དང་། ལུང་བསྟན་པ་དང་། ངེས་པའི་ཚིག་དང་། ཡི་གེ་ལྕི་ཡང་དང་། ཚིག་བསྡེབ་པ་དང་། མཆོད་སྦྱིན་གྱི་ཆོ་ག་དང་། སྐར་མའི་ལུགས་དང་། གྲངས་ཅན་གྱི་ལུགས་དང་། རྣལ་འབྱོར་གྱི་ལུགས་དང་། ལས་ཀྱི་ཚོགས་དང་། བྱེ་བྲག་པའི་ལུགས་དང་། ནོར་གྱི་རིག་པ་དང་། ཕུར་བུའི་ལུགས་དང་། ཆུའི་ལུགས་དང་། ལྷ་མ་ཡིན་གྱི་ལུགས་དང་། བྱ་དང་རི་དགས་ཀྱི་སྐད་དང་། གཏན་ཚིགས་ཀྱི་རིག་པ་དང་། རྒྱ་སྐྱེགས་ཀྱི་འཁྲུལ་འཁོར་དང་། སྤྲ་ཚིལ་གྱི་ལས་དང་། འདྲུབ་ཤུར་དང་། བརྐོ་བཞོག་དང་། ལོ་མ་དྲ་བ་དང་། སྤོས་སྦྱར་བ་ལ་སོགས་པའི་སྒྱུ་རྩལ་འཇིག་རྟེན་པ་དང་ལྷའི་དང་མིའི་ལས་འདས་པ་ཐམས་ཅད་ལའང་བྱང་ཆུབ་སེམས་དཔའ་འབའ་ཞིག་ཁྱད་པར་དུ་འཕགས་པར་གྱུར་ཏོ།
en: Having spoken thus, the gods approached the Bodhisattva, strewing him with divine flowers. In this way the Bodhisattva was superior in all the main aspects of the mundane arts, as well as in all practices beyond the reach of gods and humans. He was superior in leaping, and likewise in writing, finger counting, computation, arithmetic, wrestling, archery, running, rowing, swimming, elephant mounting, horsemanship, carriage driving, bow-and-arrow skills, balance and strength, heroics, gymnastics, elephant driving, lassoing, rising, advancing, retreating, gripping with the hand, gripping using the foot, gripping using the top of the head, cutting, cleaving, breaking, rubbing, target shooting without causing injury, target shooting at vital points, target shooting through only hearing the target, striking hard, playing dice, poetry composition, prose composition, painting, drama, dramatic action, tactical analysis, attending the sacred fire, playing the lute, playing other musical instruments, dancing, singing, chanting, storytelling, comedy, dancing to music, dramatic dancing, mimicry, garland stringing, cooling with a fan, dying precious gems, dying clothes, creating optical illusions, dream analysis, bird sounds, analysis of women, analysis of men, analysis of horses, analysis of elephants, analysis of cattle, analysis of goats, analysis of sheep, analysis of dogs, ritual science and its related lexicon, revealed scripture, ancient stories, history, the Vedas, grammar, etymologies, phonetics, metrics and composition, rules for conducting rituals, astrology, the Sāmkhya philosophical system, the Yoga philosophical system, ceremonies, the art of courtesans, the Vaiśeṣika philosophical system, economics, ethics, hydraulics, knowledge of demigods, knowledge of game animals, knowledge of bird sounds, logic, hydromechanics, beeswax crafts, sewing, wickerwork, leaf cutting, and perfume making.

source: །དེའི་ཚེ་ཤཱཀྱ་ལག་ན་བེ་ཅོན་ཅན་གྱིས་རང་གི་བུ་མོ་ས་འཚོ་མ། བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕུལ་ལོ།
en: When that became clear, the Śākya Daṇḍapāṇi decided to give away his daughter, the Śākya girl Gopā, to the Bodhisattva.

source: །རྒྱལ་པོ་ཟས་གཙང་མས་ཀྱང་། དེ་རིམ་གྱིས་བག་མར་བླངས་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕུལ་ལོ།
en: King Śuddhodana also formally requested her hand in marriage for the Bodhisattva.

source: །དེ་ན་བྱང་ཆུབ་སེམས་དཔས་འཇིག་རྟེན་དང་འཐུན་པ་ཙམ་དུ་བྱ་བའི་ཕྱིར་བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་གི་ནང་དུ་འདུག་སྟེ། དགའ་ཞིང་རྩེ་ལ་ཡོངས་སུ་སྤྱོད་པ་སྟོན་ཏོ།
en: Then indeed, in order to conform to worldly conventions, the Bodhisattva dwelt among 84,000 women and showed himself to partake of the amorous games with pleasure.

source: །བུད་མེད་བརྒྱད་ཁྲི་བཞི་སྟོང་དེ་དག་ཐམས་ཅད་ཀྱི་ནང་ན། ཤཱཀྱའི་བུ་མོ་ས་འཚོ་མ་བཙུན་མོའི་མཆོག་ཏུ་དབང་བསྐུར་བར་གྱུར་ཏོ།
en: Among the 84,000 women, the Śākya girl Gopā was consecrated as the foremost wife.

source: །དེ་ན་ཤཱཀྱའི་བུ་མོ་ས་འཚོ་མ་གྱོས་སྒྱུག་གམ་ནང་མི་གང་མཐོང་ཡང་རུང་སྟེ། གདོང་མི་སྦེད་དོ།
en: However, no matter who the Śākya girl Gopā encountered, whether it was her mother-in-law, her father-in-law, or any other member of the inner quarters, she did not cover her face.

source: །དེ་དག་ཀྱང་དེ་ལ་བག་སར་མོ་ནི་ཞུམ་ཞུམ་པོར་འདུག་པའི་རིགས་ན། འདི་ནི་རྟག་ཏུ་མ་གཡོགས་སོ་ཞེས་འཕྱ་སྨོད་ཅིང་མི་སྙན་པར་ཟེར་རོ།
en: So people criticized her and spoke badly of her, saying, “A new wife is supposed to be covered, but this one is always exposed.”

source: །དེའི་ཚེ་ཤཱཀྱའི་བུ་མོ་ས་འཚོ་མས་གཏམ་དེ་ཐོས་ནས་ནང་མི་རྣམས་ཀྱི་མདུན་དུ་འདུག་སྟེ། ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ།
en: The Śākya girl Gopā heard this rumor, and in front of all the folk of the inner quarters, she said these verses:
